app/controllers/api/v1/mappings_controller.rb

SELECT "mappings".* FROM "mappings" ORDER BY created_at DESC
---
      def index
		print '\n\nINDEX CALLED>>>'
        mappings = Mapping.order('created_at DESC');