app/controllers/api/v1/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY created_at DESC
---
      def index
		print '\n\nINDEX CALLED>>>'
        questions = Question.order('created_at DESC');

INSERT INTO "mappings" ("mapping_str", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["mapping_str", "dddd"], ["created_at", "2019-11-05 08:05:42.628955"], ["updated_at", "2019-11-05 08:05:42.628955"]]
SELECT  "mappings".* FROM "mappings" WHERE "mappings"."mapping_str" = $1 LIMIT $2  [["mapping_str", "dddd"], ["LIMIT", 1]]
INSERT INTO "roles" ("role_str", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["role_str", "Admin"], ["created_at", "2019-11-05 08:09:58.010242"], ["updated_at", "2019-11-05 08:09:58.010242"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."role_str" = $1 LIMIT $2  [["role_str", "Admin"], ["LIMIT", 1]]
INSERT INTO "questions" ("pri", "quiz", "teamingStages", "appearsDay", "frequency", "qType", "required", "conditions", "mapping_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
      def create
		print 'POST >>>>>>'
		puts params
		if params[:mapping]
			mapping = Mapping.find_or_create_by(mapping_str: params[:mapping])
			mapping.save
			params[:mapping_id] = mapping.id
		end

		if params[:role]
			role = Role.find_or_create_by(role_str: params[:roles])
			role.save
			params[:role_id] = role.id
		end

        question = Question.new(question_params)

        if question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
---
      def destroy
		print '\n\nDELETE CALLED>>>'
        question = Question.find(params[:id])
        question.destroy