app/controllers/api/v1/roles_controller.rb

SELECT "roles".* FROM "roles" ORDER BY created_at DESC
---
      def index
		print '\n\nINDEX CALLED>>>'
        roles = Role.order('created_at DESC');